doc/td/td_nombre_aleatoire.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Classe &ldquo;aléatoire&rdquo;</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" href="../stylesheets/styles.css">
                 <link rel="stylesheet" href="../stylesheets/org-pygments.css">
</head>
<body>
<div id="preamble" class="status">
</a><a href="td_pointeur_fonction.html">Compilation, pointeur & références </a><a href="td_specificite_c++.html">Spécificités du C++ </a><a href="td_classes.html">Classes en C++ </a><a href="td_classe_complexe.html">Fraction de nombres complexes </a><a href="td_nombre_aleatoire.html">Constructeur & destructeurs </a><a href="td_surcharge_operateur.html">Surcharge d'opérateur </a><a href="td_polymorphisme.html">Polymorphisme & classe abstraite </a><a href="td_blackjack.html">Jeu du blackjack </a>
                     <hr/>
                     <a href="../../index.html">Retour menu principal</a>
</div>
<div id="content">
<h1 class="title">Classe &ldquo;aléatoire&rdquo;</h1><hr/>

<div id="outline-container-unnumbered-2" class="outline-2">
<h2 id="unnumbered-2">Jeux de hasard et loi de probabilité</h2>
<div class="outline-text-2" id="text-unnumbered-2">
</div><div id="outline-container-unnumbered-3" class="outline-3">
<h3 id="unnumbered-3">Déclaration de la classe <code>Hasard</code></h3>
<div class="outline-text-3" id="text-unnumbered-3">
<ul class="org-ul">
<li>Écrire une classe <code>Hasard</code> possédant les membres suivants :

<ul class="org-ul">
<li>deux entiers constants non signés, l&rsquo;un définissant un nombre maximal de
valeurs à tirer aléatoirement, l&rsquo;autre la valeur maximale pouvant être
générée aléatoirement (<i>cf. <a href="#unnumbered-5">Addendum 1</a></i> relatif aux générateurs aléatoires),
</li>

<li>un tableau dynamique de valeurs entières non signées qui sauvegardera les
résultats des tirages aléatoires successifs.
</li>
</ul>
</li>

<li>Déclarer un constructeur qui initialisera les membres de la classe en
attachant une attention particulière à allouer correctement l&rsquo;espace mémoire
nécessaire.
</li>

<li>Déclarer un destructeur de classe qui restituera l&rsquo;espace mémoire alloué
dynamiquement.
</li>

<li>Surdéfinir une méthode permettant d&rsquo;afficher soit l&rsquo;ensemble des tirages
aléatoires soit le \(i\)<sup>ème</sup> tirage.
</li>

<li>Définir une méthode de comparaison de deux instances de <code>Hasard</code> retournant un
booléen dont la valeur sera soit <code>true</code> soit <code>false</code> selon que les deux
instances sont identiques ou pas.
</li>
</ul>

<p>
Exécuter plusieurs fois le programme en affichant l&rsquo;ensemble des valeurs
générées. Proposer une solution visant à générer, pour chaque exécution, une
nouvelle série de valeurs aléatoires.
</p>
</div>
</div>

<div id="outline-container-unnumbered-4" class="outline-3">
<h3 id="unnumbered-4">Décompte du nombre d&rsquo;instanciation de la classe <code>Hasard</code></h3>
<div class="outline-text-3" id="text-unnumbered-4">
<p>
En utilisant un membre statique (<i>cf. <a href="#unnumbered-6">Addendum 2</a></i>), déterminer le nombre
d&rsquo;objets créés au cours de l&rsquo;exécution du programme.
</p>

<p>
De la même manière, utiliser un membre statique afin d&rsquo;estimer le nombre total
d&rsquo;occurences de la valeur 0.
</p>
</div>

<div id="outline-container-unnumbered-5" class="outline-4">
<h4 id="unnumbered-5">Addendum 1</h4>
<div class="outline-text-4" id="text-unnumbered-5">
<p>
La librairie standard <code>cstdlib</code> du C++ fournit un générateur de nombre
pseudo-aléatoire <code>rand()</code> retournant une valeur entière comprise entre 0 et
<code>RAND_MAX</code>. Suivant les architectures, <code>RAND_MAX</code> peut varier d&rsquo;une machine à
l&rsquo;autre. Par ailleurs, comme un générateur de nombres aléatoires est exécuté sur
un ordinateur par nature déterministe, il devient <i>de facto</i> un algorithme
déterministe. Ses sorties sont inévitablement entachées d&rsquo;une caractéristique
absente d&rsquo;une vraie suite aléatoire : la périodicité. Avec des ressources
limitées (mémoire, nombre de registres, &#x2026;), le générateur retrouvera le même
état interne. Un générateur non périodique n&rsquo;est pas impossible, mais nécessite
une mémoire croissante pour ne pas se retrouver dans le même état. Pour
contourner cet obstacle théorique, le générateur peut commencer dans un état
quelconque (la &ldquo;graine&rdquo;, <i>seed</i> en anglais). L&rsquo;initialisation se fait par
l&rsquo;intermédiaire de la méthode <code>srand(int seed)</code> qui prend pour argument la
graine. Il produira toutefois la même séquence de nombres aléatoires si la graine
reste identique.
</p>
</div>
</div>

<div id="outline-container-unnumbered-6" class="outline-4">
<h4 id="unnumbered-6">Addendum 2</h4>
<div class="outline-text-4" id="text-unnumbered-6">
<p>
Les différentes instances d&rsquo;une classe ont toutes les mêmes méthodes. Mais
chaque instance a ses propres membres. Un membre statique est, par définition,
un <b>membre qui est le même</b>, <i>i.e.</i> situé dans le même espace mémoire, pour
toutes les instances de la classe. La syntaxe de sa déclaration est la suivante:
</p>

<div class="org-src-container">

<pre class="src src-c++"><span class="org-keyword">class</span> <span class="org-type">nom_classe</span> {
  ...
  <span class="org-keyword">static</span> type nom_variable_statique;
  ...
};
</pre>
</div>

<p>
Un membre statique doit être initialisé explicitement dans le fichier <code>.cc</code>
correspondant à la classe, avec la syntaxe suivante:
</p>

<div class="org-src-container">

<pre class="src src-c++"><span class="org-type">type</span> <span class="org-constant">nom_classe</span>::<span class="org-variable-name">nom_variable_statique</span> = valeur_initiale;
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
